RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_glb.c
    /* select root clock */
    switch (clkFreq) {
        case GLB_DSP_SYS_CLK_RC32M:
            GLB_Set_DSP_System_CLK_Div(0, 0);
            GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_RC32M);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_XCLK);
            break;
        case GLB_DSP_SYS_CLK_XTAL:
            GLB_Set_DSP_System_CLK_Div(0, 0);
            GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_XTAL);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_XCLK);
            break;
        case GLB_DSP_SYS_CLK_MM_WIFIPLL_240M:
            GLB_Set_DSP_System_CLK_Div(0, 1);
            GLB_Set_DSP_Muxpll_240M_Sel(GLB_DSP_MUXPLL_SEL_WIFIPLL_240M);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_PLL);
            /* recover xclk */
            GLB_Set_DSP_XCLK_Sel(dspXclkSel);
            break;
        case GLB_DSP_SYS_CLK_MM_WIFIPLL_320M:
            GLB_Set_DSP_System_CLK_Div(0, 1);
            GLB_Set_DSP_Muxpll_320M_Sel(GLB_DSP_MUXPLL_SEL_WIFIPLL_320M);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_PLL);
            /* recover xclk */
            GLB_Set_DSP_XCLK_Sel(dspXclkSel);
            break;
        case GLB_DSP_SYS_CLK_CPUPLL_400M:
            GLB_Set_DSP_System_CLK_Div(0, 1);
            GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_PLL);
            /* recover xclk */
            GLB_Set_DSP_XCLK_Sel(dspXclkSel);
            break;
        default:
            break;
    }
    GLB_CLK_SET_DUMMY_WAIT;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  select DSP0 pbus clock div
 *
 * @param  dspBclkDiv: mm glb bclk2x div
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_PBCLK_Div(uint8_t dspPBclkDiv)
{
    uint32_t tmpVal = 0;

    /* set div */
    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_DIV, dspPBclkDiv);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get DSP0 pbus clock div
 *
 * @param  dspBclkDiv: mm glb bclk2x div
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Get_DSP_PBCLK_Div(uint8_t *dspPBclkDiv)
{
    *dspPBclkDiv = BL_GET_REG_BITS_VAL(BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CPU), MM_GLB_REG_BCLK1X_DIV);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Set dsp pbus clock
 *
 * @param  pbClkSel: dsp pbus clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_PBCLK(GLB_DSP_SYS_PBCLK_Type pbClkSel)
{
    CHECK_PARAM(IS_GLB_DSP_SYS_PBCLK_TYPE(pbClkSel));

    GLB_Set_DSP_PBCLK_Div(0);

    /* select pbroot clock */
    switch (pbClkSel) {
        case GLB_DSP_SYS_PBCLK_RC32M:
            GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_RC32M);
            GLB_Set_DSP_PBCLK_Div(0);
            GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_MM_XCLK);
            break;
        case GLB_DSP_SYS_PBCLK_XTAL:
            GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_XTAL);
            GLB_Set_DSP_PBCLK_Div(0);
            GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_MM_XCLK);
            break;
        case GLB_DSP_SYS_PBCLK_MM_WIFIPLL_160M:
            GLB_Set_DSP_Muxpll_160M_Sel(GLB_DSP_MUXPLL_SEL_WIFIPLL_160M);
            GLB_Set_DSP_PBCLK_Div(0);
            GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_MM_MUXPLL_160M);
            break;
        case GLB_DSP_SYS_PBCLK_CPUPLL_160M:
            GLB_Set_DSP_Muxpll_160M_Sel(GLB_DSP_MUXPLL_SEL_CPUPLL_160M);
            GLB_Set_DSP_PBCLK_Div(0);
            GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_MM_MUXPLL_160M);
            break;
        case GLB_DSP_SYS_PBCLK_MM_WIFIPLL_240M:
            GLB_Set_DSP_Muxpll_240M_Sel(GLB_DSP_MUXPLL_SEL_WIFIPLL_240M);
            GLB_Set_DSP_PBCLK_Div(1);
            GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_MM_MUXPLL_240M);
            break;
        default:
            break;
    }
    GLB_CLK_SET_DUMMY_WAIT;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP0 clock enable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_DSP0_Clock_Enable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    tmpVal = BL_SET_REG_BIT(tmpVal, MM_GLB_REG_MMCPU0_CLK_EN);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP0 clock disable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_DSP0_Clock_Disable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    tmpVal = BL_CLR_REG_BIT(tmpVal, MM_GLB_REG_MMCPU0_CLK_EN);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get xclk clock source Select
 *
 * @param  None
 *
 * @return xclk clock type selection
 *
*******************************************************************************/
GLB_DSP_XCLK_Type ATTR_CLOCK_SECTION GLB_Get_DSP_XCLK_Sel(void)
{
    return (GLB_DSP_XCLK_Type)(BL_GET_REG_BITS_VAL(BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU), MM_GLB_REG_XCLK_CLK_SEL));
}

/****************************************************************************/ /**
 * @brief  Select xclk clock source
 *
 * @param  xclk: xclk clock type selection
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_XCLK_Sel(GLB_DSP_XCLK_Type xclk)
{
    uint32_t tmpVal;

