RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_glb.c
    CHECK_PARAM(IS_GLB_DSP_XCLK_TYPE(xclk));

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_XCLK_CLK_SEL, xclk);
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);
    GLB_CLK_SET_DUMMY_WAIT;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get DSP root clock
 *
 * @param  None
 *
 * @return mm glb root clock type
 *
*******************************************************************************/
GLB_DSP_ROOT_CLK_Type ATTR_CLOCK_SECTION GLB_Get_DSP_ROOT_CLK_Sel(void)
{
    uint32_t tmpVal = 0;
    uint32_t rootclk = 0;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    rootclk = BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_ROOT_CLK_SEL);
    if (0 == rootclk) {
        /* xclk */
        return GLB_DSP_ROOT_CLK_XCLK;
    } else {
        /* pll */
        return GLB_DSP_ROOT_CLK_PLL;
    }
}

/****************************************************************************/ /**
 * @brief  select DSP root clock
 *
 * @param  rootClk: mm glb root clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_ROOT_CLK_Sel(GLB_DSP_ROOT_CLK_Type rootClk)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_GLB_DSP_ROOT_CLK_TYPE(rootClk));

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    switch (rootClk) {
        case GLB_DSP_ROOT_CLK_XCLK:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_ROOT_CLK_SEL, 0);
            break;
        case GLB_DSP_ROOT_CLK_PLL:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_ROOT_CLK_SEL, 1);
            break;
        default:
            break;
    }
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);
    GLB_CLK_SET_DUMMY_WAIT;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  select DSP muxpll clock
 *
 * @param  pllClk: mm glb pll clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_MUXPLL_CLK_Sel(GLB_DSP_PLL_CLK_Type pllClk)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DSP_PLL_CLK_TYPE(pllClk));

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    switch (pllClk) {
        case GLB_DSP_PLL_CLK_MUXPLL_240M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_SEL, 0);
            break;
        case GLB_DSP_PLL_CLK_MUXPLL_320M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_SEL, 1);
            break;
        case GLB_DSP_PLL_CLK_CPUPLL_400M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_CPU_CLK_SEL, 2);
            break;
        default:
            break;
    }
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get DSP pbroot clock
 *
 * @param  None
 *
 * @return mm DSP pbroot clock type
 *
*******************************************************************************/
GLB_DSP_PBROOT_CLK_Type ATTR_CLOCK_SECTION GLB_Get_DSP_PBROOT_CLK_Sel(void)
{
    uint32_t tmpVal = 0;
    uint32_t pbrootclk = 0;

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    pbrootclk = BL_GET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_SEL);
    switch (pbrootclk) {
        case 0:
            return GLB_DSP_PBROOT_CLK_MM_XCLK;
        case 1:
            return GLB_DSP_PBROOT_CLK_MM_XCLK;
        case 2:
            return GLB_DSP_PBROOT_CLK_MM_MUXPLL_160M;
        case 3:
            return GLB_DSP_PBROOT_CLK_MM_MUXPLL_240M;
        default:
            return GLB_DSP_PBROOT_CLK_MM_XCLK;
    }
}

/****************************************************************************/ /**
 * @brief  select DSP pbroot clock
 *
 * @param  pbrootClk: mm DSP pbroot clock type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_DSP_PBROOT_CLK_Sel(GLB_DSP_PBROOT_CLK_Type pbrootClk)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_GLB_DSP_PBROOT_CLK_TYPE(pbrootClk));

    tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU);
    switch (pbrootClk) {
        case GLB_DSP_PBROOT_CLK_MM_XCLK:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_SEL, 0);
            break;
        case GLB_DSP_PBROOT_CLK_MM_MUXPLL_160M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_SEL, 2);
            break;
        case GLB_DSP_PBROOT_CLK_MM_MUXPLL_240M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, MM_GLB_REG_BCLK1X_SEL, 3);
            break;
        default:
            break;
    }
    BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_CLK_CTRL_CPU, tmpVal);
    GLB_CLK_SET_DUMMY_WAIT;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get core type
 *
 * @param  None
 *
 * @return core type
 *
*******************************************************************************/
GLB_CORE_ID_Type ATTR_CLOCK_SECTION GLB_Get_Core_Type(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_WORD(CORE_ID_ADDRESS);

    switch (tmpVal) {
        case CORE_ID_M0:
            return GLB_CORE_ID_M0;
        case CORE_ID_D0:
            return GLB_CORE_ID_D0;
        case CORE_ID_LP:
            return GLB_CORE_ID_LP;
        default:
            return GLB_CORE_ID_INVALID;
    }

    return GLB_CORE_ID_INVALID;
}

/****************************************************************************/ /**
 * @brief  hold cpu
 *
 * @param  coreID: core type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Halt_CPU(GLB_CORE_ID_Type coreID)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_CORE_ID_TYPE(coreID));

    switch (coreID) {
        case GLB_CORE_ID_M0:
            PDS_Set_MCU0_Clock_Disable();
            arch_delay_us(1);
            tmpVal = BL_RD_REG(GLB_BASE, GLB_SWRST_CFG2);
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_CTRL_CPU_RESET);
            BL_WR_REG(GLB_BASE, GLB_SWRST_CFG2, tmpVal);
            break;
        case GLB_CORE_ID_D0:
            GLB_DSP0_Clock_Disable();
            arch_delay_us(1);
            tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_SW_SYS_RESET);
            tmpVal = BL_SET_REG_BIT(tmpVal, MM_GLB_REG_CTRL_MMCPU0_RESET);
            BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_SW_SYS_RESET, tmpVal);
            break;
        case GLB_CORE_ID_LP:
            PDS_Set_LP_Clock_Disable();
            arch_delay_us(1);
            tmpVal = BL_RD_REG(GLB_BASE, GLB_SWRST_CFG2);
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_CTRL_PICO_RESET);
            BL_WR_REG(GLB_BASE, GLB_SWRST_CFG2, tmpVal);
            break;
        default:
            return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  release cpu
 *
 * @param  coreID: core type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Release_CPU(GLB_CORE_ID_Type coreID)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_CORE_ID_TYPE(coreID));

    switch (coreID) {
        case GLB_CORE_ID_M0:
            PDS_Set_MCU0_Clock_Enable();
            arch_delay_us(1);
            tmpVal = BL_RD_REG(GLB_BASE, GLB_SWRST_CFG2);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_REG_CTRL_CPU_RESET);
            BL_WR_REG(GLB_BASE, GLB_SWRST_CFG2, tmpVal);
            break;
        case GLB_CORE_ID_D0:
            GLB_DSP0_Clock_Enable();
            arch_delay_us(1);
            tmpVal = BL_RD_REG(MM_GLB_BASE, MM_GLB_MM_SW_SYS_RESET);
            tmpVal = BL_CLR_REG_BIT(tmpVal, MM_GLB_REG_CTRL_MMCPU0_RESET);
            BL_WR_REG(MM_GLB_BASE, MM_GLB_MM_SW_SYS_RESET, tmpVal);
            break;
        case GLB_CORE_ID_LP:
            PDS_Set_LP_Clock_Enable();
            arch_delay_us(1);
            tmpVal = BL_RD_REG(GLB_BASE, GLB_SWRST_CFG2);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_REG_CTRL_PICO_RESET);
            BL_WR_REG(GLB_BASE, GLB_SWRST_CFG2, tmpVal);
            break;
        default:
            return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set CPU reset address
 *
 * @param  coreID: core type
 * @param  addr: reset address
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_CPU_Reset_Address(GLB_CORE_ID_Type coreID, uint32_t addr)
{
    CHECK_PARAM(IS_GLB_CORE_ID_TYPE(coreID));

    switch (coreID) {
        case GLB_CORE_ID_M0:
            BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG14, addr);
            break;
        case GLB_CORE_ID_D0:
            BL_WR_REG(MM_MISC_BASE, MM_MISC_CPU0_BOOT, addr);
            break;
        case GLB_CORE_ID_LP:
            BL_WR_REG(PDS_BASE, PDS_CPU_CORE_CFG13, addr);
            break;
        default:
            return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP get MCU interrupt status
 *
 * @param  intType: MCU interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type GLB_DSP_Get_MCU_IntStatus(GLB_MCU_ALL_INT_Type intType)
{
    CHECK_PARAM(IS_GLB_MCU_ALL_INT_TYPE(intType));

    if (intType < 32) {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG16) & (1 << intType)) ? SET : RESET;
    } else {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG17) & (1 << (intType - 32))) ? SET : RESET;
    }
}

/****************************************************************************/ /**
 * @brief  DSP set MCU interrupt mask
 *
 * @param  intType: MCU interrupt type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_DSP_Set_MCU_IntMask(GLB_MCU_ALL_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_MCU_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG18);
        if (UNMASK != intMask) {
            tmpVal |= (1 << intType);
        } else {
            tmpVal &= ~(1 << intType);
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG18, tmpVal);
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG19);
        if (UNMASK != intMask) {
            tmpVal |= (1 << (intType - 32));
        } else {
            tmpVal &= ~(1 << (intType - 32));
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG19, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP clear MCU interrupt status
 *
 * @param  intType: MCU interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_DSP_Clr_MCU_IntStatus(GLB_MCU_ALL_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_MCU_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG20);
        tmpVal |= (1 << intType);
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG20, tmpVal);
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG21);
        tmpVal |= (1 << (intType - 32));
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG21, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP set LP interrupt enable
 *
 * @param  enable: ENABLE or DISABLE
 * @param  intType: LP interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_DSP_Set_LP_IntEn(uint8_t enable, GLB_LP_ALL_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_LP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG22);
        if (enable) {
            tmpVal |= (1 << intType);
        } else {
            tmpVal &= ~(1 << intType);
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG22, tmpVal);
    } else {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_CORE_CFG23);
        if (enable) {
            tmpVal |= (1 << (intType - 32));
        } else {
            tmpVal &= ~(1 << (intType - 32));
        }
        BL_WR_REG(GLB_BASE, GLB_CORE_CFG23, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  DSP get LP interrupt status
 *
 * @param  intType: LP interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type GLB_DSP_Get_LP_IntStatus(GLB_LP_ALL_INT_Type intType)
{
    CHECK_PARAM(IS_GLB_LP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG24) & (1 << intType)) ? SET : RESET;
    } else {
        return (BL_RD_REG(GLB_BASE, GLB_CORE_CFG25) & (1 << (intType - 32))) ? SET : RESET;
    }
}

/****************************************************************************/ /**
 * @brief  MCU get DSP interrupt status
 *
 * @param  intType: DSP interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type GLB_MCU_Get_DSP_IntStatus(GLB_DSP_ALL_INT_Type intType)
{
    CHECK_PARAM(IS_GLB_DSP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        return (BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_STA0) & (1 << intType)) ? SET : RESET;
    } else {
        return (BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_STA1) & (1 << (intType - 32))) ? SET : RESET;
    }
}

/****************************************************************************/ /**
 * @brief  MCU set DSP interrupt mask
 *
 * @param  intType: DSP interrupt type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_MCU_Set_DSP_IntMask(GLB_DSP_ALL_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DSP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK0);
        if (UNMASK != intMask) {
            tmpVal |= (1 << intType);
        } else {
            tmpVal &= ~(1 << intType);
        }
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK0, tmpVal);
    } else {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK1);
        if (UNMASK != intMask) {
            tmpVal |= (1 << (intType - 32));
        } else {
            tmpVal &= ~(1 << (intType - 32));
        }
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_MASK1, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  MCU clear DSP interrupt status
 *
 * @param  intType: DSP interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_MCU_Clr_DSP_IntStatus(GLB_DSP_ALL_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DSP_ALL_INT_TYPE(intType));

    if (intType < 32) {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_0);
        tmpVal |= (1 << intType);
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_0, tmpVal);
    } else {
        tmpVal = BL_RD_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_1);
        tmpVal |= (1 << (intType - 32));
        BL_WR_REG(MM_MISC_BASE, MM_MISC_MM_INT_CLR_1, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set MTimer clock
 *
 * @param  enable: enable or disable
 * @param  clkSel: clock selection
 * @param  div: divider
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_EMI_CLK(uint8_t enable, GLB_EMI_CLK_Type clkSel, uint32_t div)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_GLB_EMI_CLK_TYPE(clkSel));
    CHECK_PARAM((div <= 0x3));

    /* disable EMI clock first */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_EMI_CFG0);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_REG_EMI_CLK_EN);
    BL_WR_REG(GLB_BASE, GLB_EMI_CFG0, tmpVal);

